In [15]:
from datetime import datetime, date
import pandas as pd
import json

In [2]:
df = pd.read_json('data/clients.json')
df

,name,birthdate,joined,Id
0,Julius Edwards,1951-06-22T20:28:01,2015-07-17T19:44:45,clients/1
1,Camila Whitehouse,1948-01-27T02:33:41,2013-01-30T15:54:55,clients/2
2,Adelaide Walter,1942-12-10T00:19:52,2013-01-12T20:42:28,clients/3
3,Christine Atkinson,1957-10-15T13:56:14,2015-03-15T16:16:13,clients/4
4,Juliet Herbert,1942-09-05T16:22:40,2015-08-04T11:50:00,clients/5
...,...,...,...,...
99995,Darlene Morrison,1941-04-12T18:57:01,2017-05-05T17:28:50,clients/99996
99996,Margaret Clarkson,1986-05-19T10:50:13,2015-11-13T01:19:43,clients/99997
99997,Dani Clifton,1998-06-10T08:37:36,2013-01-08T00:13:00,clients/99998
99998,Alan Cork,1980-10-25T21:41:04,2014-04-18T07:10:50,clients/99999
99999,Lorraine Graham,1980-03-06T08:04:26,2013-12-13T15:28:25,clients/100000

In [18]:
def parseDate(date):
    date = date.replace('Z', '')
    test_date = datetime.strptime(date, "%Y-%m-%d %X")
    return test_date.isoformat()

def createUsername(x):
    names = x['name'].split()
    return f"{names[0]}-{names[1]}-{x['birthdate'][:4]}"

In [ ]:
df['birthdate'] = df['birthdate'].map(lambda x: parseDate(x))
df['joined'] = df['joined'].map(lambda x: parseDate(x))

In [19]:
df['username'] = df.apply(lambda x: createUsername(x), axis=1)

In [20]:
df

,name,birthdate,joined,Id,username
0,Julius Edwards,1951-06-22T20:28:01,2015-07-17T19:44:45,clients/1,Julius-Edwards-1951
1,Camila Whitehouse,1948-01-27T02:33:41,2013-01-30T15:54:55,clients/2,Camila-Whitehouse-1948
2,Adelaide Walter,1942-12-10T00:19:52,2013-01-12T20:42:28,clients/3,Adelaide-Walter-1942
3,Christine Atkinson,1957-10-15T13:56:14,2015-03-15T16:16:13,clients/4,Christine-Atkinson-1957
4,Juliet Herbert,1942-09-05T16:22:40,2015-08-04T11:50:00,clients/5,Juliet-Herbert-1942
...,...,...,...,...,...
99995,Darlene Morrison,1941-04-12T18:57:01,2017-05-05T17:28:50,clients/99996,Darlene-Morrison-1941
99996,Margaret Clarkson,1986-05-19T10:50:13,2015-11-13T01:19:43,clients/99997,Margaret-Clarkson-1986
99997,Dani Clifton,1998-06-10T08:37:36,2013-01-08T00:13:00,clients/99998,Dani-Clifton-1998
99998,Alan Cork,1980-10-25T21:41:04,2014-04-18T07:10:50,clients/99999,Alan-Cork-1980
99999,Lorraine Graham,1980-03-06T08:04:26,2013-12-13T15:28:25,clients/100000,Lorraine-Graham-1980

In [7]:
df['Id'] = df['client_id'].map(lambda x: 'clients/' + str(x))

In [12]:
df.drop(columns='client_id', inplace=True)

In [13]:
df

,name,birthdate,joined,Id
0,Julius Edwards,1951-06-22T20:28:01,2015-07-17T19:44:45,clients/1
1,Camila Whitehouse,1948-01-27T02:33:41,2013-01-30T15:54:55,clients/2
2,Adelaide Walter,1942-12-10T00:19:52,2013-01-12T20:42:28,clients/3
3,Christine Atkinson,1957-10-15T13:56:14,2015-03-15T16:16:13,clients/4
4,Juliet Herbert,1942-09-05T16:22:40,2015-08-04T11:50:00,clients/5
...,...,...,...,...
99995,Darlene Morrison,1941-04-12T18:57:01,2017-05-05T17:28:50,clients/99996
99996,Margaret Clarkson,1986-05-19T10:50:13,2015-11-13T01:19:43,clients/99997
99997,Dani Clifton,1998-06-10T08:37:36,2013-01-08T00:13:00,clients/99998
99998,Alan Cork,1980-10-25T21:41:04,2014-04-18T07:10:50,clients/99999
99999,Lorraine Graham,1980-03-06T08:04:26,2013-12-13T15:28:25,clients/100000

In [ ]:
result = df.to_json(orient="records", default_handler=str)

parsed = json.loads(result)

json_string = json.dumps(parsed, indent=4)
with open('data/clients.json', 'w') as outfile:
    outfile.write(json_string)